; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-4-1-238)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-2 - location
	p0-6 - location
	p5-0 - location
	p5-2 - location
	p5-4 - location
	p5-6 - location
	p2-1 - location
	p2-6 - location
	p6-1 - location
	p4-0 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s6)
	(at driver3 s1)
	(at truck1 s5)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s6)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s5)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s4)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 90)
	(= (time-to-walk p0-2 s0) 90)
	(= (time-to-walk s2 p0-2) 10)
	(= (time-to-walk p0-2 s2) 10)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 43)
	(= (time-to-walk p0-6 s0) 43)
	(= (time-to-walk s6 p0-6) 4)
	(= (time-to-walk p0-6 s6) 4)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 38)
	(= (time-to-walk p5-0 s5) 38)
	(= (time-to-walk s0 p5-0) 56)
	(= (time-to-walk p5-0 s0) 56)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 47)
	(= (time-to-walk p5-2 s5) 47)
	(= (time-to-walk s2 p5-2) 76)
	(= (time-to-walk p5-2 s2) 76)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 81)
	(= (time-to-walk p5-4 s5) 81)
	(= (time-to-walk s4 p5-4) 56)
	(= (time-to-walk p5-4 s4) 56)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 85)
	(= (time-to-walk p5-6 s5) 85)
	(= (time-to-walk s6 p5-6) 41)
	(= (time-to-walk p5-6 s6) 41)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 36)
	(= (time-to-walk p2-1 s2) 36)
	(= (time-to-walk s1 p2-1) 73)
	(= (time-to-walk p2-1 s1) 73)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 67)
	(= (time-to-walk p2-6 s2) 67)
	(= (time-to-walk s6 p2-6) 79)
	(= (time-to-walk p2-6 s6) 79)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 89)
	(= (time-to-walk p6-1 s6) 89)
	(= (time-to-walk s1 p6-1) 5)
	(= (time-to-walk p6-1 s1) 5)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 7)
	(= (time-to-walk p4-0 s4) 7)
	(= (time-to-walk s0 p4-0) 18)
	(= (time-to-walk p4-0 s0) 18)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 35)
	(= (time-to-drive s5 s6) 35)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 73)
	(= (time-to-drive s0 s1) 73)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 84)
	(= (time-to-drive s2 s1) 84)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 82)
	(= (time-to-drive s3 s1) 82)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 11)
	(= (time-to-drive s6 s1) 11)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 70)
	(= (time-to-drive s0 s3) 70)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 70)
	(= (time-to-drive s5 s3) 70)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 30)
	(= (time-to-drive s2 s0) 30)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 47)
	(= (time-to-drive s5 s2) 47)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 18)
	(= (time-to-drive s6 s2) 18)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 77)
	(= (time-to-drive s1 s4) 77)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 70)
	(= (time-to-drive s0 s5) 70)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 39)
	(= (time-to-drive s4 s5) 39)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver3 s6)
	(at truck1 s1)
	(at truck3 s2)
	(at truck4 s1)
	(at package1 s0)
	))

(:metric minimize (+ (* 1 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver2 s6 p5-6)
   deleted: (at driver2 s6)
   added: (at driver2 p5-6)
   goals met: 0 of 6
2. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 0 of 6
3. (walk driver2 p5-6 s5)
   deleted: (at driver2 p5-6)
   added: (at driver2 s5)
   goals met: 0 of 6
4. (drive-truck truck3 s1 s2 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 0 to 840
   goals met: 1 of 6
5. (board-truck driver2 truck1 s5)
   deleted: (at driver2 s5) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 6
6. (drive-truck truck1 s5 s4 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   changed: (fuel-used) from 840 to 1230
   goals met: 1 of 6
7. (load-truck package1 truck1 s4)
   deleted: (at package1 s4)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 6
8. (drive-truck truck1 s4 s5 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (fuel-used) from 1230 to 1659
   goals met: 1 of 6
9. (drive-truck truck3 s2 s6 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 1659 to 1839
   goals met: 0 of 6
10. (drive-truck truck1 s5 s0 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (fuel-used) from 1839 to 2609
   goals met: 0 of 6
11. (unload-truck package1 truck1 s0)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 1 of 6
12. (disembark-truck driver3 truck3 s6)
   deleted: (driving driver3 truck3)
   added: (at driver3 s6) (empty truck3)
   goals met: 2 of 6
13. (walk driver3 s6 p5-6)
   deleted: (at driver3 s6)
   added: (at driver3 p5-6)
   goals met: 1 of 6
14. (walk driver3 p5-6 s5)
   deleted: (at driver3 p5-6)
   added: (at driver3 s5)
   goals met: 1 of 6
15. (board-truck driver3 truck4 s5)
   deleted: (at driver3 s5) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 1 of 6
16. (drive-truck truck4 s5 s6 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s6)
   changed: (fuel-used) from 2609 to 2959
   goals met: 1 of 6
17. (drive-truck truck1 s0 s3 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 2959 to 3659
   goals met: 1 of 6
18. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 1 of 6
19. (board-truck driver1 truck1 s3)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 6
20. (drive-truck truck1 s3 s1 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 3659 to 4479
   goals met: 2 of 6
21. (disembark-truck driver3 truck4 s6)
   deleted: (driving driver3 truck4)
   added: (at driver3 s6) (empty truck4)
   goals met: 3 of 6
22. (board-truck driver3 truck3 s6)
   deleted: (at driver3 s6) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 2 of 6
23. (drive-truck truck3 s6 s2 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s2)
   changed: (fuel-used) from 4479 to 4659
   goals met: 3 of 6
24. (drive-truck truck1 s1 s6 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   changed: (fuel-used) from 4659 to 4769
   goals met: 2 of 6
25. (disembark-truck driver3 truck3 s2)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 2 of 6
26. (walk driver3 s2 p2-6)
   deleted: (at driver3 s2)
   added: (at driver3 p2-6)
   goals met: 2 of 6
27. (walk driver3 p2-6 s6)
   deleted: (at driver3 p2-6)
   added: (at driver3 s6)
   goals met: 3 of 6
28. (board-truck driver3 truck4 s6)
   deleted: (at driver3 s6) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 2 of 6
29. (drive-truck truck4 s6 s5 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s5)
   changed: (fuel-used) from 4769 to 5119
   goals met: 2 of 6
30. (drive-truck truck1 s6 s1 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   changed: (fuel-used) from 5119 to 5229
   goals met: 3 of 6
31. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 5229 to 5959
   goals met: 2 of 6
32. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 3 of 6
33. (drive-truck truck4 s5 s3 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s3)
   changed: (fuel-used) from 5959 to 6659
   goals met: 3 of 6
34. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 2 of 6
35. (disembark-truck driver3 truck4 s3)
   deleted: (driving driver3 truck4)
   added: (at driver3 s3) (empty truck4)
   goals met: 2 of 6
36. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 3 of 6
37. (board-truck driver2 truck4 s3)
   deleted: (at driver2 s3) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 3 of 6
38. (drive-truck truck4 s3 s1 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   changed: (fuel-used) from 6659 to 7479
   goals met: 4 of 6
39. (drive-truck truck4 s1 s6 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s6)
   changed: (fuel-used) from 7479 to 7589
   goals met: 3 of 6
40. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 2 of 6
41. (drive-truck truck1 s0 s3 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 7589 to 8289
   goals met: 2 of 6
42. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 2 of 6
43. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 6
44. (drive-truck truck1 s3 s1 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 8289 to 9109
   goals met: 3 of 6
45. (disembark-truck driver3 truck1 s1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s1) (empty truck1)
   goals met: 3 of 6
46. (walk driver3 s1 p6-1)
   deleted: (at driver3 s1)
   added: (at driver3 p6-1)
   goals met: 3 of 6
47. (walk driver3 p6-1 s6)
   deleted: (at driver3 p6-1)
   added: (at driver3 s6)
   goals met: 4 of 6
48. (disembark-truck driver2 truck4 s6)
   deleted: (driving driver2 truck4)
   added: (at driver2 s6) (empty truck4)
   goals met: 4 of 6
49. (board-truck driver3 truck2 s6)
   deleted: (at driver3 s6) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 3 of 6
50. (board-truck driver2 truck4 s6)
   deleted: (at driver2 s6) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 3 of 6
51. (drive-truck truck2 s6 s5 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   changed: (fuel-used) from 9109 to 9459
   goals met: 3 of 6
52. (drive-truck truck4 s6 s1 driver2)
   deleted: (at truck4 s6)
   added: (at truck4 s1)
   changed: (fuel-used) from 9459 to 9569
   goals met: 4 of 6
53. (drive-truck truck2 s5 s3 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   changed: (fuel-used) from 9569 to 10269
   goals met: 4 of 6
54. (disembark-truck driver2 truck4 s1)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 4 of 6
55. (disembark-truck driver3 truck2 s3)
   deleted: (driving driver3 truck2)
   added: (at driver3 s3) (empty truck2)
   goals met: 4 of 6
56. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 4 of 6
57. (drive-truck truck2 s3 s5 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (fuel-used) from 10269 to 10969
   goals met: 4 of 6
58. (drive-truck truck2 s5 s6 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   changed: (fuel-used) from 10969 to 11319
   goals met: 4 of 6
59. (disembark-truck driver1 truck2 s6)
   deleted: (driving driver1 truck2)
   added: (at driver1 s6) (empty truck2)
   goals met: 4 of 6
60. (walk driver1 s6 p0-6)
   deleted: (at driver1 s6)
   added: (at driver1 p0-6)
   goals met: 4 of 6
61. (walk driver1 p0-6 s0)
   deleted: (at driver1 p0-6)
   added: (at driver1 s0)
   goals met: 5 of 6
62. (board-truck driver2 truck4 s1)
   deleted: (at driver2 s1) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 5 of 6
63. (drive-truck truck4 s1 s3 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (fuel-used) from 11319 to 12139
   goals met: 4 of 6
64. (drive-truck truck4 s3 s5 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s5)
   changed: (fuel-used) from 12139 to 12839
   goals met: 4 of 6
65. (drive-truck truck4 s5 s0 driver2)
   deleted: (at truck4 s5)
   added: (at truck4 s0)
   changed: (fuel-used) from 12839 to 13539
   goals met: 4 of 6
66. (disembark-truck driver2 truck4 s0)
   deleted: (driving driver2 truck4)
   added: (at driver2 s0) (empty truck4)
   goals met: 4 of 6
67. (board-truck driver1 truck4 s0)
   deleted: (at driver1 s0) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 3 of 6
68. (drive-truck truck4 s0 s3 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (fuel-used) from 13539 to 14239
   goals met: 3 of 6
69. (disembark-truck driver1 truck4 s3)
   deleted: (driving driver1 truck4)
   added: (at driver1 s3) (empty truck4)
   goals met: 3 of 6
70. (board-truck driver3 truck4 s3)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 3 of 6
71. (drive-truck truck4 s3 s1 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   changed: (fuel-used) from 14239 to 15059
   goals met: 4 of 6
72. (disembark-truck driver3 truck4 s1)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 4 of 6
73. (walk driver3 s1 p6-1)
   deleted: (at driver3 s1)
   added: (at driver3 p6-1)
   goals met: 4 of 6
74. (walk driver3 p6-1 s6)
   deleted: (at driver3 p6-1)
   added: (at driver3 s6)
   goals met: 5 of 6
75. (board-truck driver3 truck2 s6)
   deleted: (at driver3 s6) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 4 of 6
76. (drive-truck truck2 s6 s5 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   changed: (fuel-used) from 15059 to 15409
   goals met: 4 of 6
77. (drive-truck truck2 s5 s0 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   changed: (fuel-used) from 15409 to 16109
   goals met: 4 of 6
78. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 4 of 6
79. (walk driver3 s0 p0-6)
   deleted: (at driver3 s0)
   added: (at driver3 p0-6)
   goals met: 4 of 6
80. (walk driver3 p0-6 s6)
   deleted: (at driver3 p0-6)
   added: (at driver3 s6)
   goals met: 5 of 6
81. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 6
82. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 16109 to 16809
   goals met: 5 of 6
83. (disembark-truck driver2 truck2 s3)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 5 of 6
84. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 5 of 6
85. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 16809 to 17509
   goals met: 5 of 6
86. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 6 of 6
